Revit 2026 API

# RebarShapeConstraintFixedSegmentDir Constructor

---

Create a fixed segment direction constraint.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarShapeConstraintFixedSegmentDir(
	UV dir
)
```
```vb
Public Sub New (
	dir As UV
)
```
```cpp
public:
RebarShapeConstraintFixedSegmentDir(
	UV^ dir
)
```
```fsharp
new :
        dir : UV -> RebarShapeConstraintFixedSegmentDir
```

#### Parameters

dir UV
     A fixed direction in UV-space.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | dir has zero length. |

#### Reference

RebarShapeConstraintFixedSegmentDir Class

Autodesk.Revit.DB.Structure Namespace